src/Catalogs/МенюЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МенюЛояльности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Станция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементыМеню</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыМенюЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Comment>Товар/Очистить купоны/Очистить карту лояльности</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияЭлементовМеню</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСУПтовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстКнопки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/МенюЛояльности/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	МенюЛояльности.Ссылка
	|ИЗ
	|	Справочник.МенюЛояльности КАК МенюЛояльности
	|ГДЕ
	|	МенюЛояльности.Регион = &Регион
	|	И МенюЛояльности.МестоРеализации = &МестоРеализации
	|	И МенюЛояльности.Станция = &Станция
	|	И МенюЛояльности.Ссылка <> &Ссылка");

	Запрос.УстановитьПараметр("Регион", Регион);
	Запрос.УстановитьПараметр("МестоРеализации", МестоРеализации);
	Запрос.УстановитьПараметр("Станция", Станция);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Если Не Запрос.Выполнить().Пустой() Тогда
		#Если Клиент Тогда
		Предупреждение("Настройка меню с таким сочетанием региона, станции и места реализации уже есть в справочнике!");
		#КонецЕсли
		Отказ = Истина;
	КонецЕсли;
	
	Наименование = "" + МестоРеализации + " " + Регион + ?(Станция.Пустая(), "", " (" + Станция + ")");
КонецПроцедуры
